
GConfig = {}


GConfig.Card = 
{
0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1a,0x1b,0x1c,0x1d,	--方块
0x21,0x22,0x23,0x24,0x25,0x26,0x27,0x28,0x29,0x2a,0x2b,0x2c,0x2d,	--梅花
0x31,0x32,0x33,0x34,0x35,0x36,0x37,0x38,0x39,0x3a,0x3b,0x3c,0x3d,	--红桃
0x41,0x42,0x43,0x44,0x45,0x46,0x47,0x48,0x49,0x4a,0x4b,0x4c,0x4d,   --黑桃
--0x51,0x52, -- 小鬼，大鬼
}

GConfig.BaseNumber = 0x10

GConfig.GameType = {
	KanPaiNiuNiu = 178,
	SuiJiNiuNiu = 102 ,
	TongBiNiuNiu = 103, 
	--BaiRenNiuNiu = 104,
}

function GConfig.GameTypeToID(GameType)
	if GameType == 102 then
		return 2
	end
end 

function GConfig.IDToGameType(nID)
	if nID == 2 then
		return 102
	end
end 
-- 对应的玩法ID
GConfig.HuID = {
	[1] = 0,
	[2] = 1,
	[3] = 2,
	[4] = 3, 
	[5] = 4,
	[6] = 5,
	[7] = 6,
	[8] = 7,
	[9] = 8,
	[10] = 9,
	[11] = 10,
	[12] = 101, -- 五花牛
	[13] = 102, -- 四炸
	[14] = 103, -- 五小
}

GConfig.HuType = 
{
	[1] = "无牛",--
	[2] = '牛一',--
	[3] = '牛二',--
	[4] = '牛三',--
	[5] = '牛四',--
	[6] = '牛五',
	[7] = '牛六',--
	[8] = '牛七',
	[9] = '牛八',
	[10] = '牛九',
	[11] = '牛牛',
	[12] = '五花牛',
	[13] = '四炸',--
	[14] = '五小',--
}

-- 根据名字获取玩法ID
function GConfig.GetPlayValue(sName) 
	for k, v in pairs (GConfig.HuType) do
		if v == sName then
			return GConfig.HuID[k]
		end
	end
end

-- 根据牛几获取名字
function GConfig.GetNiuType(nNiuWhat) 
	for k, v in pairs (GConfig.HuID) do
		if v == nNiuWhat then
			return GConfig.HuType[k]
		end
	end
end


--没牛-牛1-牛2....牛10.五小牛的牌型对应的ID
GConfig.HuPlayFunc =
{
	[1] = {[1] = 0, [2] = 1, [3] = 2, [4] = 3, [5] = 4, [6] = 5, [7] = 6, [8] = 7, [9] = 8, [10] = 9, [11] = 10, [12] = 101, [13] = 102, [14] = 103},
	--百人牛牛
	[2] = {[1] = 0, [2] = 1, [3] = 2, [4] = 3, [5] = 4, [6] = 5, [7] = 6, [8] = 7, [9] = 8, [10] = 9, [11] = 10, [12] = 101, [13] = 102, [14] = 103}, -- 3倍场
	[3] = {[1] = 0, [2] = 1, [3] = 2, [4] = 3, [5] = 4, [6] = 5, [7] = 6, [8] = 7, [9] = 8, [10] = 9, [11] = 10, [12] = 101, [13] = 102, [14] = 103},
	[4] = {[1] = 0, [2] = 1, [3] = 2, [4] = 3, [5] = 4, [6] = 5, [7] = 6, [8] = 7, [9] = 8, [10] = 9, [11] = 10, [12] = 101, [13] = 102, [14] = 103},
}

--HuPlayFunc的对应倍数{[1]=随机庄家牛牛}

GConfig.HuFan =
{
	[1] = {[1] = 1, [2] = 1, [3] = 1, [4] = 1, [5] = 1, [6] = 1, [7] = 1, [8] = 2, [9] =2 , [10] = 2, [11] = 3, [12] = 4, [13] = 5, [14] = 8},
	--百人牛牛倍场
	[2] = {[1] = 1, [2] = 1, [3] = 1, [4] = 1, [5] = 1, [6] = 1, [7] = 1, [8] = 2, [9] =2 , [10] = 2, [11] = 3, [12] = 3, [13] = 3, [14] = 3}, -- 3倍场
	[3] = {[1] = 1, [2] = 1, [3] = 1, [4] = 1, [5] = 1, [6] = 1, [7] = 1, [8] = 3, [9] =3 , [10] = 3, [11] = 5, [12] = 5, [13] = 5, [14] = 5}, -- 5倍场
	[4] = {[1] = 1, [2] = 1, [3] = 2, [4] = 3, [5] = 4, [6] = 5, [7] = 6, [8] = 7, [9] =8 , [10] = 9, [11] = 10, [12] = 10, [13] = 10, [14] = 10}, -- 10倍场
	
}

--玩家动作id
GConfig.EnumAction =
{
	nNull	  	= 0, --玩家不需要操作，则动作为空
	nQiangZhuang= 1, -- 玩家抢庄
	nXiaZhu     = 2, -- 玩家下注
}

-- 游戏类型的牌数量
GConfig.GamePai= 
{
	[1] = 13,   --  麻将
	[2] = 5,    --  牛牛
	[3] = 3,    --  三公
	[4] = 3,    --  炸金花

}

--百人牛牛
GConfig.ShangZhuangCofig = {
	 2000, 5000, 20000, 100000
}

GConfig.XiaZhuCofing = {
	{1, 5, 10, 50, 100},
	{5, 10, 50, 100, 500},
	{10, 50, 100, 500, 1000},
	{50, 100, 500, 1000, 5000}
}

return GConfig

